.ai revize comit
